performance/results/location-search/20260810-190138-elasticsearch-geo-keyword/warmup.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/accommodation-location-search.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 35s max duration (incl. graceful stop):
              * default: 1 looping VUs for 5s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 213 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1.0s/5s

running (02.0s), 1/1 VUs, 437 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2.0s/5s

running (03.0s), 1/1 VUs, 689 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3.0s/5s

running (04.0s), 1/1 VUs, 973 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4.0s/5s

running (05.0s), 1/1 VUs, 1200 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  5.0s/5s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6010    1200.957089/s
    checks_succeeded...: 100.00% 6010 out of 6010
    checks_failed......: 0.00%   0 out of 6010

    ✓ HTTP 상태가 200이다
    ✓ success 값이 true이다
    ✓ data 값이 배열이다
    ✓ data 개수가 limit을 초과하지 않는다
    ✓ 검색 결과가 거리순으로 정렬되어 있다

    HTTP
    http_req_duration..............: avg=3.94ms min=2.35ms med=3.71ms p(90)=4.9ms  p(95)=5.34ms p(99)=7.79ms max=53.55ms
      { expected_response:true }...: avg=3.94ms min=2.35ms med=3.71ms p(90)=4.9ms  p(95)=5.34ms p(99)=7.79ms max=53.55ms
    http_req_failed................: 0.00%  0 out of 1202
    http_reqs......................: 1202   240.191418/s

    EXECUTION
    iteration_duration.............: avg=4.15ms min=2.47ms med=3.92ms p(90)=5.19ms p(95)=5.63ms p(99)=8.05ms max=64.68ms
    iterations.....................: 1202   240.191418/s
    vus............................: 1      min=1         max=1
    vus_max........................: 1      min=1         max=1

    NETWORK
    data_received..................: 5.1 MB 1.0 MB/s
    data_sent......................: 216 kB 43 kB/s



running (05.0s), 0/1 VUs, 1202 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  5s